instance_eval(File.read("brewfiles/Brewfile.core"))

# brew 'rbenv'
brew 'nvm'
brew 'cloudflared'

# TODO might not be needed
brew 'ghq'

brew 'fisher'

brew 'rustup'

brew 'television'

brew 'direnv'

brew 'siderolabs/tap/talosctl'
brew 'helm'

brew 'hashicorp/tap/nomad'

brew 'jj'

brew 'ansible'

# Apps
cask 'ghostty'
cask 'dropbox'
cask 'orbstack'

cask 'rectangle-pro'

cask 'ngrok'

cask 'zed'

cask 'obsidian'
